In [131]:
%load_ext sql
%sql ibm_db_sa://mng80479:VD2X2NNvhWqLPRAZ@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB?security=SSL

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [132]:
import pandas as pd
import numpy as np
import matplotlib as plt 
import seaborn as sns

Просмотрим все схемы

In [133]:
%sql SELECT SCHEMANAME FROM SYSCAT.SCHEMATA

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
   sqlite:///Chicago.db
Done.

[('SYSIBM  ',),
 ('SYSCAT  ',),
 ('SYSFUN  ',),
 ('SYSSTAT ',),
 ('SYSPROC ',),
 ('SYSIBMADM',),
 ('SYSIBMINTERNAL',),
 ('SYSIBMTS',),
 ('SYSPUBLIC',),
 ('NULLID  ',),
 ('SQLJ    ',),
 ('SYSTOOLS',),
 ('DSWEBSECURITY',),
 ('IBMADT  ',),
 ('IBMPDQ  ',),
 ('DB2INST1',),
 ('DB2GSE  ',),
 ('ST_INFORMTN_SCHEMA',),
 ('DSWEB   ',),
 ('DSSCHED ',),
 ('PROCMGMT',),
 ('DSSHSV1 ',),
 ('DSJOBMGR',),
 ('IBMOTS  ',),
 ('IDAX    ',),
 ('IBM_RTMON_DATA',),
 ('ERRORSCHEMA',),
 ('IBM_RTMON_EVMON',),
 ('IBM_RTMON_METADATA',),
 ('IBM_RTMON_BASELINE',),
 ('IBM_DSM_VIEWS',),
 ('HEALTHMETRICS',),
 ('IBMCONSOLE',),
 ('IBM_RTMON',),
 ('AUDIT   ',),
 ('MNG80479',)]

Выберем схему и узнаем имена таблиц в ней

In [134]:
%sql SELECT TABNAME FROM SYSCAT.TABLES WHERE TABSCHEMA = 'MNG80479'

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
   sqlite:///Chicago.db
Done.

[('CARS',),
 ('PHONES',),
 ('HOUSES',),
 ('CHICAGO_SCHOOLS',),
 ('SOCIOECONOMIC',),
 ('SOCIOECONOMIC_DATA',),
 ('CRIME',)]

In [135]:
%%sql
SELECT COLNAME, TYPENAME, LENGTH, SCALE, NULLS
FROM SYSCAT.COLUMNS
WHERE TABNAME = 'SOCIOECONOMIC'

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
   sqlite:///Chicago.db
Done.

[('COMMUNITY_AREA_NUMBER', 'INTEGER', 4, 0, 'Y'),
 ('COMMUNITY_AREA_NAME', 'VARCHAR', 22, 0, 'Y'),
 ('PERCENT_OF_HOUSING_CROWDED', 'DECIMAL', 4, 1, 'Y'),
 ('PERCENT_HOUSEHOLDS_BELOW_POVERTY', 'DECIMAL', 4, 1, 'Y'),
 ('PERCENT_AGED_16__UNEMPLOYED', 'DECIMAL', 4, 1, 'Y'),
 ('PERCENT_AGED_25__WITHOUT_HIGH_SCHOOL_DIPLOMA', 'DECIMAL', 4, 1, 'Y'),
 ('PERCENT_AGED_UNDER_18_OR_OVER_64', 'DECIMAL', 4, 1, 'Y'),
 ('PER_CAPITA_INCOME', 'INTEGER', 4, 0, 'Y'),
 ('HARDSHIP_INDEX', 'SMALLINT', 2, 0, 'Y')]

In [136]:
%sql select * from SOCIOECONOMIC WHERE community_area_number is null

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
   sqlite:///Chicago.db
Done.

[(None, 'CHICAGO', Decimal('4.7'), Decimal('19.7'), Decimal('12.9'), Decimal('19.5'), Decimal('33.5'), 28202, None)]

In [137]:
%sql select count(*) from socioeconomic

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
   sqlite:///Chicago.db
Done.

[(78,)]

In [138]:
%%sql
SELECT COLNAME
FROM SYSCAT.COLUMNS
WHERE TABNAME = 'SOCIOECONOMIC'

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
   sqlite:///Chicago.db
Done.

[('COMMUNITY_AREA_NAME',),
 ('COMMUNITY_AREA_NUMBER',),
 ('HARDSHIP_INDEX',),
 ('PERCENT_AGED_16__UNEMPLOYED',),
 ('PERCENT_AGED_25__WITHOUT_HIGH_SCHOOL_DIPLOMA',),
 ('PERCENT_AGED_UNDER_18_OR_OVER_64',),
 ('PERCENT_HOUSEHOLDS_BELOW_POVERTY',),
 ('PERCENT_OF_HOUSING_CROWDED',),
 ('PER_CAPITA_INCOME',)]

## ВАРИАНТ СОЗДАНИЯ НОВОЙ ТАБЛИЦЫ

Создадим новую таблицу

In [139]:
%%sql
CREATE TABLE SOCIOECONOMIC_DATA (
COMMUNITY_AREA_NUMBER INTEGER PRIMARY KEY GENERATED BY DEFAULT AS IDENTITY
(START WITH 1, INCREMENT BY 1) NOT NULL,
COMMUNITY_AREA_NAME VARCHAR(22),
PERCENT_OF_HOUSING_CROWDED DECIMAL(4),
PERCENT_HOUSEHOLDS_BELOW_POVERTY DECIMAL(4),
PERCENT_AGED_16_UNEMPLOYED DECIMAL(4),
PERCENT_AGED_25_WITHOUT_HIGH_SCHOOL_DIPLOMA DECIMAL(4),
PERCENT_AGED_UNDER_18_OR_OVER_64 DECIMAL(4),
PER_CAPITA_INCOME INTEGER,
HARDSHIP_INDEX  SMALLINT
)

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
   sqlite:///Chicago.db
(ibm_db_dbi.ProgrammingError) ibm_db_dbi::ProgrammingError: Statement Execute Failed: [IBM][CLI Driver][DB2/LINUXX8664] SQL0601N  The name of the object to be created is identical to the existing name "MNG80479.SOCIOECONOMIC_DATA" of type "TABLE".  SQLSTATE=42710  SQLCODE=-601
[SQL: CREATE TABLE SOCIOECONOMIC_DATA (
COMMUNITY_AREA_NUMBER INTEGER PRIMARY KEY GENERATED BY DEFAULT AS IDENTITY
(START WITH 1, INCREMENT BY 1) NOT NULL,
COMMUNITY_AREA_NAME VARCHAR(22),
PERCENT_OF_HOUSING_CROWDED DECIMAL(4),
PERCENT_HOUSEHOLDS_BELOW_POVERTY DECIMAL(4),
PERCENT_AGED_16_UNEMPLOYED DECIMAL(4),
PERCENT_AGED_25_WITHOUT_HIGH_SCHOOL_DIPLOMA DECIMAL(4),
PERCENT_AGED_UNDER_18_OR_OVER_64 DECIMAL(4),
PER_CAPITA_INCOME INTEGER,
HARDSHIP_INDEX  SMALLINT
)]
(Background on this error at: http://sqlalche.me/e/13/f405)

Вставляем данные во вторую таблицу

In [140]:
%%sql
INSERT INTO SOCIOECONOMIC_DATA (COMMUNITY_AREA_NAME,
       HARDSHIP_INDEX,
       PERCENT_AGED_16_UNEMPLOYED,
       PERCENT_AGED_25_WITHOUT_HIGH_SCHOOL_DIPLOMA,
       PERCENT_AGED_UNDER_18_OR_OVER_64,
       PERCENT_HOUSEHOLDS_BELOW_POVERTY,
       PERCENT_OF_HOUSING_CROWDED,
       PER_CAPITA_INCOME)
SELECT COMMUNITY_AREA_NAME,
       HARDSHIP_INDEX,
       PERCENT_AGED_16__UNEMPLOYED,
       PERCENT_AGED_25__WITHOUT_HIGH_SCHOOL_DIPLOMA,
       PERCENT_AGED_UNDER_18_OR_OVER_64,
       PERCENT_HOUSEHOLDS_BELOW_POVERTY,
       PERCENT_OF_HOUSING_CROWDED,
       PER_CAPITA_INCOME
FROM SOCIOECONOMIC

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
   sqlite:///Chicago.db
78 rows affected.

[]

In [141]:
%sql SELECT * FROM SOCIOECONOMIC_DATA limit 10

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
   sqlite:///Chicago.db
Done.

[(1, 'Rogers Park', Decimal('7'), Decimal('23'), Decimal('8'), Decimal('18'), Decimal('27'), 23939, 39),
 (2, 'West Ridge', Decimal('7'), Decimal('17'), Decimal('8'), Decimal('20'), Decimal('38'), 23040, 46),
 (3, 'Uptown', Decimal('3'), Decimal('24'), Decimal('8'), Decimal('11'), Decimal('22'), 35787, 20),
 (4, 'Lincoln Square', Decimal('3'), Decimal('10'), Decimal('8'), Decimal('13'), Decimal('25'), 37524, 17),
 (5, 'North Center', Decimal('0'), Decimal('7'), Decimal('5'), Decimal('4'), Decimal('26'), 57123, 6),
 (6, 'Lake View', Decimal('1'), Decimal('11'), Decimal('4'), Decimal('2'), Decimal('17'), 60058, 5),
 (7, 'Lincoln Park', Decimal('0'), Decimal('12'), Decimal('5'), Decimal('3'), Decimal('21'), 71551, 2),
 (8, 'Near North Side', Decimal('1'), Decimal('12'), Decimal('7'), Decimal('2'), Decimal('22'), 88669, 1),
 (9, 'Edison Park', Decimal('1'), Decimal('3'), Decimal('6'), Decimal('7'), Decimal('35'), 40959, 8),
 (10, 'Norwood Park', Decimal('2'), Decimal('5'), Decimal('9'), Decimal('11'), Decimal('39'), 32875, 21)]

In [142]:
%sql DELETE from socioeconomic_data WHERE COMMUNITY_AREA_NAME like 'CHICAGO'

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
   sqlite:///Chicago.db
1 rows affected.

[]

In [143]:
data = %sql SELECT * FROM SOCIOECONOMIC_DATA

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
   sqlite:///Chicago.db
Done.

In [144]:
data = %sql SELECT * FROM SOCIOECONOMIC_DATA
df_socioeconomic = pd.DataFrame(data)
headers = ['COMMUNITY_AREA_NUMBER', 
       'COMMUNITY_AREA_NAME',
       'HARDSHIP_INDEX',
       'PERCENT_AGED_16_UNEMPLOYED',
       'PERCENT_AGED_25_WITHOUT_HIGH_SCHOOL_DIPLOMA',
       'PERCENT_AGED_UNDER_18_OR_OVER_64',
       'PERCENT_HOUSEHOLDS_BELOW_POVERTY',
       'PERCENT_OF_HOUSING_CROWDED',
       'PER_CAPITA_INCOME']
df_socioeconomic.columns=headers
df_socioeconomic.head(8)

 * ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
   sqlite:///Chicago.db
Done.

,COMMUNITY_AREA_NUMBER,COMMUNITY_AREA_NAME,HARDSHIP_INDEX,PERCENT_AGED_16_UNEMPLOYED,PERCENT_AGED_25_WITHOUT_HIGH_SCHOOL_DIPLOMA,PERCENT_AGED_UNDER_18_OR_OVER_64,PERCENT_HOUSEHOLDS_BELOW_POVERTY,PERCENT_OF_HOUSING_CROWDED,PER_CAPITA_INCOME
0,1,Rogers Park,7,23,8,18,27,23939,39
1,2,West Ridge,7,17,8,20,38,23040,46
2,3,Uptown,3,24,8,11,22,35787,20
3,4,Lincoln Square,3,10,8,13,25,37524,17
4,5,North Center,0,7,5,4,26,57123,6
5,6,Lake View,1,11,4,2,17,60058,5
6,7,Lincoln Park,0,12,5,3,21,71551,2
7,8,Near North Side,1,12,7,2,22,88669,1

In [145]:
df_socioeconomic.dtypes

COMMUNITY_AREA_NUMBER                           int64
COMMUNITY_AREA_NAME                            object
HARDSHIP_INDEX                                 object
PERCENT_AGED_16_UNEMPLOYED                     object
PERCENT_AGED_25_WITHOUT_HIGH_SCHOOL_DIPLOMA    object
PERCENT_AGED_UNDER_18_OR_OVER_64               object
PERCENT_HOUSEHOLDS_BELOW_POVERTY               object
PERCENT_OF_HOUSING_CROWDED                      int64
PER_CAPITA_INCOME                               int64
dtype: object

In [146]:
# Заменим  на инт 
df_socioeconomic['HARDSHIP_INDEX'] = df_socioeconomic['HARDSHIP_INDEX'].astype(int)
df_socioeconomic['PERCENT_AGED_16_UNEMPLOYED'] = df_socioeconomic['PERCENT_AGED_16_UNEMPLOYED'].astype(float)
df_socioeconomic['PERCENT_AGED_25_WITHOUT_HIGH_SCHOOL_DIPLOMA'] = df_socioeconomic['PERCENT_AGED_25_WITHOUT_HIGH_SCHOOL_DIPLOMA'].astype(float)
df_socioeconomic['PERCENT_AGED_UNDER_18_OR_OVER_64'] = df_socioeconomic['PERCENT_AGED_UNDER_18_OR_OVER_64'].astype(float)
df_socioeconomic['PERCENT_HOUSEHOLDS_BELOW_POVERTY'] = df_socioeconomic['PERCENT_HOUSEHOLDS_BELOW_POVERTY'].astype(float)

In [147]:
df_socioeconomic.describe()

,COMMUNITY_AREA_NUMBER,HARDSHIP_INDEX,PERCENT_AGED_16_UNEMPLOYED,PERCENT_AGED_25_WITHOUT_HIGH_SCHOOL_DIPLOMA,PERCENT_AGED_UNDER_18_OR_OVER_64,PERCENT_HOUSEHOLDS_BELOW_POVERTY,PERCENT_OF_HOUSING_CROWDED,PER_CAPITA_INCOME
count,154.000000,154.000000,154.000000,154.000000,154.000000,154.000000,154.000000,154.000000
mean,78.000000,4.454545,21.272727,14.935065,19.844156,35.285714,25563.168831,49.506494
std,45.035208,3.642686,11.515986,7.504835,11.775753,7.275812,15243.038883,28.596642
min,1.000000,0.000000,3.000000,4.000000,2.000000,13.000000,8201.000000,1.000000
25%,39.250000,2.000000,13.000000,9.000000,11.000000,32.000000,15754.000000,25.000000
50%,78.000000,3.000000,18.000000,13.000000,18.000000,38.000000,21323.000000,50.000000
75%,116.750000,6.000000,29.000000,20.000000,26.000000,40.000000,28887.000000,74.000000
max,155.000000,15.000000,56.000000,35.000000,54.000000,51.000000,88669.000000,98.000000

In [ ]:
import sqlite3
# Создаем соединение с базой данных SQLite
conn = sqlite3.connect('Chicago.db')

# Сохраняем датафрейм в базу данных
df_socioeconomic.to_sql('socioeconomic', conn)

# Закрываем соединение
conn.close()

In [152]:
%sql sqlite:///Chicago.db

In [153]:
%sql SELECT name FROM sqlite_master WHERE type='table'

   ibm_db_sa://mng80479:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/BLUDB
 * sqlite:///Chicago.db
Done.

[('socioeconomic',)]